app/controllers/todo_items_controller.rb

  def create

	  @todo_item = @todo_list.todo_items.new(todo_item_params)
	if @todo_item.save
---
INSERT INTO "todo_items" ("content", "created_at", "todo_list_id", "updated_at") VALUES (?, ?, ?, ?)  [["content", "wash the dishes"], ["created_at", "2014-11-06 04:25:38.168828"], ["todo_list_id", 1], ["updated_at", "2014-11-06 04:25:38.168828"]]

def edit

   @todo_item = @todo_list.todo_items.find(params[:id])
---
SELECT  "todo_items".* FROM "todo_items"  WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT 1  [["todo_list_id", 1], ["id", 1]]

def update

    @todo_item = @todo_list.todo_items.find(params[:id])
  if @todo_item.update_attributes(todo_item_params)
---
SELECT  "todo_items".* FROM "todo_items"  WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT 1  [["todo_list_id", 1], ["id", 3]]
UPDATE "todo_items" SET "content" = ?, "updated_at" = ? WHERE "todo_items"."id" = 3  [["content", "sweep the floors"], ["updated_at", "2014-11-06 04:46:34.492738"]]

def find_todo_list
  @todo_list = TodoList.find(params[:todo_list_id])
---
SELECT  "todo_lists".* FROM "todo_lists"  WHERE "todo_lists"."id" = ? LIMIT 1  [["id", 1]]